app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `employes`
WHERE `role` = 'rh'
AND `actif` = 1
SELECT COUNT(*) AS `numrows`
FROM `departements`
---
    public function stats()
    {
        $this->requireAdmin();

        $congeModel = new CongeModel();
        $soldeModel = new SoldeModel();
        $db         = \Config\Database::connect();
        $annee      = (int) date('Y');
        $moisCourant = date('Y-m');

        // Métriques globales
        $nbEmployes   = $db->table('employes')->where('role', 'employe')->where('actif', 1)->countAllResults();
        $nbRh         = $db->table('employes')->where('role', 'rh')->where('actif', 1)->countAllResults();
        $nbDepts      = $db->table('departements')->countAllResults();

SELECT *
FROM `departements`
---
    public function employes()
    {
        $this->requireAdmin();

        $model     = new EmployeModel();
        $deptModel = new DepartementModel();

        $employes = $model->getAllWithDepartement();

        return view('admin/employe', [
            'title'    => 'Gestion des employés',
            'employes' => $employes,
            'depts'    => $deptModel->findAll(),
        ]);