app/Controllers/BaseController.php

SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `employe_id` = 4
AND `statut` = 'en_attente'
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'en_attente'
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Load here all helpers you want to be available in your controllers that extend BaseController.
        // Caution: Do not put the this below the parent::initController() call below.
        $this->helpers = ['form', 'url'];

        // Caution: Do not edit this line.
        parent::initController($request, $response, $logger);

        // Preload any models, libraries, etc, here.
        $this->session = service('session');

        // Compteur global utilisé par la sidebar.
        // On le recalcule à chaque requête pour éviter un badge figé.
        if ($this->session->get('isLoggedIn')) {
            $role = $this->session->get('userRole');
            $db = \Config\Database::connect();
            $builder = $db->table('conges');

            if ($role === 'employe') {
                $pendingCount = $builder
                    ->where('employe_id', (int) $this->session->get('userId'))
                    ->where('statut', 'en_attente')
                    ->countAllResults();
            } else {
                $pendingCount = $builder
                    ->where('statut', 'en_attente')
                    ->countAllResults();