app/Controllers/EmployeController.php

INSERT INTO `conges` (`employe_id`, `type_conge_id`, `date_debut`, `date_fin`, `nb_jours`, `motif`, `statut`, `created_at`) VALUES (6, 1, '2026-05-13', '2026-06-20', 28, 'test2', 'en_attente', '2026-05-13 09:14:09')
---
        }

        // Insertion
        $congeModel->insert([
            'employe_id'    => $empId,
            'type_conge_id' => $typeId,
            'date_debut'    => $debut,
            'date_fin'      => $fin,
            'nb_jours'      => $nbJours,
            'motif'         => $motif,
            'statut'        => 'en_attente',
            'created_at'    => date('Y-m-d H:i:s'),
        ]);

SELECT *
FROM `employes`
WHERE `employes`.`id` = 6
---
    public function profil()
    {
        $this->requireEmploye();
        $model = new EmployeModel();
        $emp   = $model->find($this->empId());