app/Controllers/RhController.php

SELECT *
FROM `conges`
WHERE `conges`.`id` = 5
UPDATE `conges` SET `statut` = 'refuse', `traite_par` = 2, `commentaire_rh` = 'ee'
WHERE `conges`.`id` IN (5)
---
    public function refuser(int $id)
    {
        $this->requireRh();
        $congeModel = new CongeModel();
        $soldeModel = new SoldeModel();
        $conge      = $congeModel->find($id);

        if (!$conge || !in_array($conge['statut'], ['en_attente', 'approuve'], true)) {
            return redirect()->to('/rh')->with('error', 'Demande introuvable ou déjà traitée.');
        }

        $commentaire = $this->request->getPost('commentaire_rh') ?: 'Demande refusée.';

        if ($conge['statut'] === 'approuve') {
            $annee = (int) date('Y', strtotime($conge['date_debut']));
            $soldeModel->recréditer($conge['employe_id'], $conge['type_conge_id'], $annee, (int)$conge['nb_jours']);
        }

        $congeModel->update($id, [
            'statut'         => 'refuse',
            'traite_par'     => $this->session->get('userId'),
            'commentaire_rh' => $commentaire,
        ]);