app/Models/CongeModel.php

    public function getByEmploye(int $empId): array
    {
        return $this->select('conges.*, types_conge.libelle AS type_libelle')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->where('conges.employe_id', $empId)
            ->orderBy('conges.created_at', 'DESC')
            ->findAll();
---
SELECT `conges`.*, `types_conge`.`libelle` AS `type_libelle`
FROM `conges`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`employe_id` = 4
ORDER BY `conges`.`created_at` DESC

    public function getAllWithDetails(): array
    {
        return $this->select('conges.*,
                types_conge.libelle AS type_libelle,
                employes.nom, employes.prenom, employes.departement_id,
                departements.nom AS dept_nom')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->join('employes', 'employes.id = conges.employe_id')
            ->join('departements', 'departements.id = employes.departement_id', 'left')
            ->orderBy('conges.created_at', 'DESC')
            ->findAll();
---
SELECT `conges`.*, `types_conge`.`libelle` AS `type_libelle`, `employes`.`nom`, `employes`.`prenom`, `employes`.`departement_id`, `departements`.`nom` AS `dept_nom`
FROM `conges`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
ORDER BY `conges`.`created_at` DESC

    public function hasChevauchement(int $empId, string $debut, string $fin, ?int $excludeId = null): bool
    {
        $q = $this->where('employe_id', $empId)
            ->whereIn('statut', ['en_attente', 'approuve'])
            ->groupStart()
                ->where('date_debut <=', $fin)
                ->where('date_fin >=', $debut)
            ->groupEnd();

        if ($excludeId) {
            $q->where('id !=', $excludeId);
        }
        return $q->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `employe_id` = 6
AND `statut` IN ('en_attente','approuve')
AND   (
`date_debut` <= '2026-06-20'
AND `date_fin` >= '2026-05-13'
 )

    public function statsAdmin(): array
    {
        $db = \Config\Database::connect();
        $all = $db->table('conges')->select('statut')->get()->getResultArray();
---
SELECT `statut`
FROM `conges`