app/Models/EmployeModel.php

SELECT *
FROM `employes`
WHERE `email` = 'tsiry@techmada.mg'
 LIMIT 1
---
    public function findByEmail(string $email): ?array
    {
        return $this->where('email', $email)->first();

SELECT `employes`.*, `departements`.`nom` AS `departement_nom`
FROM `employes`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
ORDER BY `employes`.`nom`
---
    public function getAllWithDepartement(): array
    {
        return $this->select('employes.*, departements.nom AS departement_nom')
            ->join('departements', 'departements.id = employes.departement_id', 'left')
            ->orderBy('employes.nom')
            ->findAll();

SELECT `employes`.*, `departements`.`nom` AS `departement_nom`
FROM `employes`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
WHERE `employes`.`id` = 3
 LIMIT 1
---
    public function findWithDepartement(int $id): ?array
    {
        return $this->select('employes.*, departements.nom AS departement_nom')
            ->join('departements', 'departements.id = employes.departement_id', 'left')
            ->where('employes.id', $id)
            ->first();