app/Models/SoldeModel.php

    public function getSoldesEmploye(int $empId, ?int $annee = null): array
    {
        $annee = $annee ?? (int)date('Y');
        return $this->select('soldes.*, types_conge.libelle, types_conge.deductible')
            ->join('types_conge', 'types_conge.id = soldes.type_conge_id')
            ->where('soldes.employe_id', $empId)
            ->where('soldes.annee', $annee)
            ->findAll();
---
SELECT `soldes`.*, `types_conge`.`libelle`, `types_conge`.`deductible`
FROM `soldes`
JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`
WHERE `soldes`.`employe_id` = 4
AND `soldes`.`annee` = 2026

    public function getSolde(int $empId, int $typeId, int $annee): ?array
    {
        return $this->where('employe_id', $empId)
            ->where('type_conge_id', $typeId)
            ->where('annee', $annee)
            ->first();
---
SELECT *
FROM `soldes`
WHERE `employe_id` = 3
AND `type_conge_id` = 1
AND `annee` = 2026
 LIMIT 1

    public function recréditer(int $empId, int $typeId, int $annee, int $nbJours): bool
    {
        $solde = $this->getSolde($empId, $typeId, $annee);
        if (!$solde) return false;

        $nouveauxPris = max(0, $solde['jours_pris'] - $nbJours);
        return $this->update($solde['id'], ['jours_pris' => $nouveauxPris]);
---
UPDATE `soldes` SET `jours_pris` = 3
WHERE `soldes`.`id` IN (7)

    public function getAllSoldesAnnee(int $annee): array
    {
        return $this->select('soldes.*, types_conge.libelle,
                employes.nom, employes.prenom, employes.departement_id,
                departements.nom AS dept_nom')
            ->join('types_conge', 'types_conge.id = soldes.type_conge_id')
            ->join('employes', 'employes.id = soldes.employe_id')
            ->join('departements', 'departements.id = employes.departement_id', 'left')
            ->where('soldes.annee', $annee)
            ->orderBy('employes.nom')
            ->findAll();
---
SELECT `soldes`.*, `types_conge`.`libelle`, `employes`.`nom`, `employes`.`prenom`, `employes`.`departement_id`, `departements`.`nom` AS `dept_nom`
FROM `soldes`
JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`
JOIN `employes` ON `employes`.`id` = `soldes`.`employe_id`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
WHERE `soldes`.`annee` = 2026
ORDER BY `employes`.`nom`